app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "seat_id_seq", "address", "price_paid", "email_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "phone" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["phone", "aaaa"], ["updated_at", "2016-01-24 13:09:09.108842"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 980190962]]
---
  def destroy
    @ticket.destroy